tutorials/N2.jet.LES/c3.LEMOS.PR/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2;
    format          ascii;
    class           dictionary;
    location        "system";
    object          controlDict;
}

libs
(
    "libInflowGenerator.so"
);

application     reactingFoam;

//startFrom       startTime;
startFrom       latestTime;

startTime       0;
stopAt          endTime;
//stopAt          writeNow;

endTime         0.3;
deltaT          1e-5;

writeControl    adjustableRunTime;
//writeControl    runTime;
//writeControl    clockTime;

writeInterval   0.001;
//writeInterval   21450;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep    no;
//adjustTimeStep    yes;

maxCo           0.3;

functions
{
   #include "fieldAverage"
   //#include "turbulenceFields"
   //#include "resolvedTKE"
   //#include "subgridTKE"
   //#include "totalTKE"
   //#include "TKEratio"
}

// ************************************************************************* //
