tutorials/N2.jet.LES/c3.LEMOS.PR/0/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 298;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 126.9;
    }

    outlet
    {
//        type            zeroGradient;
        type            inletOutlet;
        inletValue      uniform 298;
        value           uniform 298;
    }

    frontWall
    {
        type            fixedValue;
        value           uniform 298;
    }

    outerWall
    {   
        type            fixedValue;
        value           uniform 298;
    }

}


// ************************************************************************* //
