tutorials/N2.jet.LES/c3.LEMOS.PR/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 1.0;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 1.0;
    }

    outlet
    {
        //type            zeroGradient;
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    frontWall
    {
        type            kqRWallFunction;
        value           uniform 1;
        //type            zeroGradient;
    }

    outerWall
    {   
        type            kqRWallFunction;
        value           uniform 1;
        //type            zeroGradient;
    }
}


// ************************************************************************* //
